[
  {
    "id": 1,
    "title": "One Piece",
    "title_japanese": "ワンピース",
    "author": "Eiichiro Oda",
    "year": "1997",
    "genres": "Action, Adventure, Comedy, Fantasy",
    "status": "Đang tiến hành",
    "volumes": "105",
    "chapters": "1089",
    "synopsis": "Gol D. Roger, vua hải tặc với tài sản vô giá One Piece đã làm thay đổi thế giới.",
    "image_url": "https://cdn.myanimelist.net/images/manga/2/253146.jpg",
    "rating": "9.15",
    "members": 465789,
    "favorites": 89456,
    "source": "MyAnimeList",
    "added_date": "2024-03-31T10:45:00"
  },
  {
    "id": 3,
    "title": "One Piece 1000-wa Kinen! Tokubetsu Bangai-hen",
    "title_japanese": "ONE PIECE 1000話記念! 特別番外編",
    "author": "Yabuki, Kentarou, Inagaki, Riichiro, Boichi, Shimabukuro, Mitsutoshi, Tamura, Ryuuhei, Horikoshi, Kouhei, Koyama, Yuujirou, Tabata, Yuuki, Nakamura, Atsushi, Hasegawa, Tomohiro, Nakama, Ryou, Gondaira, Hitsuji, Akutami, Gege, Matsuura, Kento, Tozuka, Yoshifumi, Koumoto, Hajime, Miyazaki, Shuuhei, Gotou, Tougo, Kamiki, Kei, Kakazu, Kazu, Suzuki, Yuuto",
    "year": "2021",
    "genres": "Comedy, Fantasy",
    "status": "Hoàn thành",
    "volumes": null,
    "chapters": 19,
    "synopsis": "Collection of 19 short stories, with the theme of pirates, by various Weekly Shounen Jump mangaka that had ongoing serializations in the 2021 #5-6 issue.",
    "image_url": "https://cdn.myanimelist.net/images/manga/3/266234.jpg",
    "rating": "6.56",
    "members": 686,
    "favorites": 3,
    "source": "Jikan API (MyAnimeList)",
    "url": "https://myanimelist.net/manga/150042/One_Piece_1000-wa_Kinen_Tokubetsu_Bangai-hen",
    "added_date": "2025-03-31T22:38:01.676968"
  },
  {
    "title": "Oyasumi Punpun",
    "title_japanese": "おやすみプンプン",
    "author": "Asano, Inio",
    "year": "2007",
    "genres": "Drama, Slice of Life",
    "status": "Hoàn thành",
    "volumes": 13,
    "chapters": 147,
    "synopsis": "Punpun Onodera is a normal 11-year-old boy living in Japan. Hopelessly idealistic and romantic, Punpun begins to see his life take a subtle—though nonetheless startling—turn to the adult when he meets the new girl in his class, Aiko Tanaka. It is then that the quiet boy learns just how fickle maintaining a relationship can be, and the surmounting difficulties of transitioning from a naive boyhood to a convoluted adulthood. When his father assaults his mother one night, Punpun realizes another thing: those whom he looked up to were not as impressive as he once thought.\n\nAs his problems increase, Punpun's once shy demeanor turns into voluntary reclusiveness. Rather than curing him of his problems and conflicting emotions, this merely intensifies them, sending him down the dark path of maturity in this grim coming-of-age saga.\n\n[Written by MAL Rewrite]",
    "image_url": "https://cdn.myanimelist.net/images/manga/3/266834.jpg",
    "rating": "8.99",
    "members": 480167,
    "favorites": 55640,
    "source": "Jikan API (MyAnimeList)",
    "url": "https://myanimelist.net/manga/4632/Oyasumi_Punpun",
    "rank": 14,
    "id": 4,
    "added_date": "2025-03-31T22:48:32.261064"
  },
  {
    "title": "Vagabond",
    "title_japanese": "バガボンド",
    "author": "Inoue, Takehiko, Yoshikawa, Eiji",
    "year": "1998",
    "genres": "Action, Adventure, Award Winning",
    "status": "Tạm ngừng",
    "volumes": 37,
    "chapters": 327,
    "synopsis": "In 16th-century Japan, Shinmen Takezou is a wild, rough young man in both his appearance and his actions. His aggressive nature has won him the collective reproach and fear of his village, leading him and his best friend, Matahachi Honiden, to run away in search of something grander than provincial life. The pair enlist in the Toyotomi army, yearning for glory—but when the Toyotomi suffer a crushing defeat at the hands of the Tokugawa Clan at the Battle of Sekigahara, the friends barely make it out alive.\n\nAfter the two are separated, Shinmen returns home on a self-appointed mission to notify the Hon'iden family of Matahachi's survival. He instead finds himself a wanted criminal, framed for his friend's supposed murder based on his history of violence. Upon being captured, he is strung up on a tree and left to die. An itinerant monk, the distinguished Takuan Soho, takes pity on the \"devil child,\" secretly freeing Shinmen and christening him with a new name to avoid pursuit by the authorities: Musashi Miyamoto.\n\nVagabond is the fictitious retelling of the life of one of Japan's most renowned swordsmen, the \"Sword Saint\" Musashi Miyamoto—his rise from a swordsman with no desire other than to become \"Invincible Under the Heavens\" to an enlightened warrior who slowly learns of the importance of close friends, self-reflection, and life itself.\n\n[Written by MAL Rewrite]",
    "image_url": "https://cdn.myanimelist.net/images/manga/1/259070.jpg",
    "rating": "9.27",
    "members": 418699,
    "favorites": 45548,
    "source": "Jikan API (MyAnimeList)",
    "url": "https://myanimelist.net/manga/656/Vagabond",
    "rank": 3,
    "id": 5,
    "added_date": "2025-03-31T22:48:44.404569"
  },
  {
    "title": "Kaguya-sama wa Kokurasetai: Tensai-tachi no Renai Zunousen",
    "title_japanese": "かぐや様は告らせたい～天才たちの恋愛頭脳戦～",
    "author": "Akasaka, Aka",
    "year": "2015",
    "genres": "Award Winning, Comedy, Romance",
    "status": "Hoàn thành",
    "volumes": 28,
    "chapters": 281,
    "synopsis": "Considered a genius due to having the highest grades in the country, Miyuki Shirogane leads the prestigious Shuchiin Academy's student council as its president, working alongside the beautiful and wealthy vice president Kaguya Shinomiya. The two are often regarded as the perfect couple by students despite them not being in any sort of romantic relationship.\n\nHowever, the truth is that after spending so much time together, the two have developed feelings for one another; unfortunately, neither is willing to confess, as doing so would be a sign of weakness. With their pride as elite students on the line, Miyuki and Kaguya embark on a quest to do whatever is necessary to get a confession out of the other. Through their daily antics, the battle of love begins!\n\n[Written by MAL Rewrite]",
    "image_url": "https://cdn.myanimelist.net/images/manga/3/188896.jpg",
    "rating": "8.89",
    "members": 284874,
    "favorites": 29328,
    "source": "Jikan API (MyAnimeList)",
    "url": "https://myanimelist.net/manga/90125/Kaguya-sama_wa_Kokurasetai__Tensai-tachi_no_Renai_Zunousen",
    "id": 6,
    "added_date": "2025-03-31T22:59:26.339831"
  },
  {
    "title": "Grand Blue",
    "title_japanese": "ぐらんぶる",
    "author": "Inoue, Kenji, Yoshioka, Kimitake",
    "year": "2014",
    "genres": "Comedy",
    "status": "Đang tiến hành",
    "volumes": null,
    "chapters": null,
    "synopsis": "Among the seaside town of Izu's ocean waves and rays of shining sun, Iori Kitahara is just beginning his freshman year at Izu University. As he moves into his uncle's scuba diving shop, Grand Blue, he eagerly anticipates his dream college life, filled with beautiful girls and good friends.\n\nBut things don't exactly go according to plan. Upon entering the shop, he encounters a group of rowdy, naked upperclassmen, who immediately coerce him into participating in their alcoholic activities. Though unwilling at first, Iori quickly gives in and becomes the heart and soul of the party. Unfortunately, this earns him the scorn of his cousin, Chisa Kotegawa, who walks in at precisely the wrong time. Undeterred, Iori still vows to realize his ideal college life, but will things go according to plan this time, or will his situation take yet another dive?\n\n[Written by MAL Rewrite]",
    "image_url": "https://cdn.myanimelist.net/images/manga/2/166124.jpg",
    "rating": "9.03",
    "members": 189319,
    "favorites": 18270,
    "source": "Jikan API (MyAnimeList)",
    "url": "https://myanimelist.net/manga/70345/Grand_Blue",
    "rank": 12,
    "id": 7,
    "added_date": "2025-04-15T20:38:05.767321"
  },
  {
    "title": "Fullmetal Alchemist",
    "title_japanese": "鋼の錬金術師",
    "author": "Arakawa, Hiromu",
    "year": "2001",
    "genres": "Action, Adventure, Award Winning, Drama, Fantasy",
    "status": "Hoàn thành",
    "volumes": 27,
    "chapters": 116,
    "synopsis": "Alchemists are knowledgeable and naturally talented individuals who can manipulate and modify matter due to their art. Yet despite the wide range of possibilities, alchemy is not as all-powerful as most would believe. Human transmutation is strictly forbidden, and whoever attempts it risks severe consequences. Even so, siblings Edward and Alphonse Elric decide to ignore this great taboo and bring their mother back to life. Unfortunately, not only do they fail in resurrecting her, they also pay an extremely high price for their arrogance: Edward loses his left leg and Alphonse his entire body. Furthermore, Edward also gives up his right arm in order to seal his brother's soul into a suit of armor.\n\nYears later, the young alchemists travel across the country looking for the Philosopher's Stone, in the hopes of recovering their old bodies with its power. However, their quest for the fated stone also leads them to unravel far darker secrets than they could ever imagine.\n\n[Written by MAL Rewrite]",
    "image_url": "https://cdn.myanimelist.net/images/manga/3/243675.jpg",
    "rating": "9.04",
    "members": 309537,
    "favorites": 30735,
    "source": "Jikan API (MyAnimeList)",
    "url": "https://myanimelist.net/manga/25/Fullmetal_Alchemist",
    "rank": 8,
    "id": 8,
    "added_date": "2025-04-15T20:38:11.710885"
  },
  {
    "title": "Houseki no Kuni",
    "title_japanese": "宝石の国",
    "author": "Ichikawa, Haruko",
    "year": "2012",
    "genres": "Action, Drama, Fantasy",
    "status": "Hoàn thành",
    "volumes": 13,
    "chapters": 108,
    "synopsis": "Long ago, Earth was struck by six meteorites, creating six moons and leaving a lone island in their wake. Those who could not make it to the island sank to the bottom of the ocean, where, over time, they slowly turned to crystal. As countless millennia passed, 28 of these crystallized lifeforms, known as the Lustrous, rose from the depths and resided on the island. Led by the wise Kongou-sensei, they must defend themselves against the seemingly infinite number of Lunarians, inhabitants of the moons who seek to harvest their valuable bodies for crafting weapons and jewelry. \n\nHouseki no Kuni centers around Phosphophyllite, a young gem about to turn three hundred years old. Clumsy, extremely fragile, and having no visible talent, they are one of the weakest gems around, unable to help in the fight against the Lunarians in any meaningful way. But as the battle with the otherworldly invaders rages on, they soon learn that power comes at a cost that no one should have to pay.\n\n[Written by MAL Rewrite]",
    "image_url": "https://cdn.myanimelist.net/images/manga/1/115443.jpg",
    "rating": "8.97",
    "members": 153489,
    "favorites": 16777,
    "source": "Jikan API (MyAnimeList)",
    "url": "https://myanimelist.net/manga/44489/Houseki_no_Kuni",
    "rank": 15,
    "id": 9,
    "added_date": "2025-04-15T20:38:17.662001"
  }
]